// 存储长度较短的类型赋值给存储长度较长的类型：补足有效位，其它位补 0
// 假设有如下定义：

int main() {
    char c = 56;
    short num = 67;
    int m;
    long long int n;

    // 如果执行以下操作：
    m = ((int) c);
    n = ((long long) num);
}

// 那么它们在内存以 2 进制格式分别存储为：
//
//                                                                00111000  //Binary of 'c'
//                                                       00000000 01000011  //Binary of 'num'
//                                     00000000 00000000 00000000 00111000  //Binary of 'm'
// 00000000 00000000 00000000 00000000 00000000 00000000 00000000 01000011  //Binary of 'n'
